KASTORPROJECT/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>EnumRef.ТипыИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Сервера</types>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКБазе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/Enums/ТипыИнформационныхБаз/ТипыИнформационныхБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИнформационныхБаз</name>
  <enumValues>
    <name>Файловый</name>
  </enumValues>
  <enumValues>
    <name>Серверный</name>
  </enumValues>
</mdclass:Enum>

KASTORPROJECT/src/Catalogs/ИнформационныеБазы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЗагрузитьПользователей(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ИнформационнаяБаза", Объект.Ссылка);
	ОткрытьФорму("Обработка.ЗагрузкаПользователейИзБазы1С.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипБазыПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипБазы = Перечисления.ТипыИнформационныхБаз.Серверный;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	Если Объект.ТипБазы = Перечисления.ТипыИнформационныхБаз.Серверный Тогда
		Элементы.ПутьКБазе.Заголовок = "Имя базы на сервере 1С";
	Иначе
		Элементы.ПутьКБазе.Заголовок = "Путь к базе на файловом сервере";
	КонецЕсли;
КонецПроцедуры
